{
  "basics" : {
    "text" : "**Basics**\n\n** Selecting Slots**\nTo select a slot to edit, click on the slot inside the inventory GUI. The slot will be highlighted (color we choose) if it has been selected.\n\n**Setting the itemstacks type*\nAfter selecting a slot, to set an itemstack's type you need to click the Material selector inside the Stack Details tab and scroll down the list till you find the itemstack you want. Keep in mind the names of each item are the same as those in-game, which are not the same as the Material types for Bukkit or Spigot \n\n**Setting the name of an itemstack** To change the name of an itemstack, click on the Name Editor inside the Stack Details tab. The name editor supports ChatColors and color codes.\n\n**Setting the lore of an itemstack**\nTo set the lore of an itemstack, select the Lore editor in the Lore tab. In here, each new line in the editor represents a new line in the lore. The lore editor supports chatcolors.\n\n**Adding Enchantments**\nTo add enchantments, you have to select the Enchantments tab. From there, select the enchantment you want to add and the power level. Once you set those values, click the \"Add Enchantment\" button to add the enchantment. To remove an enchantment, click the \"remove enchantment\" button while having the enchatnment selector set to thr enchantment you want to remove.\n\n Note that you can only add one of each type of enchantment to an itemstack. Adding a new enchentment that has the same enchantment type as another existing enchantment will override the previous enchantmet.\n\n==Editing the Inventory==\n\n**Chaning the name of the inventory**\nYou can edit the name of the inventory by editing the Iinventory name rditor inside the Inventory tab. The inventory name editor supports chatcolors.\n\n**Chaning the amount of rows for the inventory**\nTo change the amount of rows for the inventory, select the row count inside the Inventory tab. \n\nNote that any itemstack in the deleted row will also be delelted as well."
  }
}
