{
  "text" : {
    "tutorial-0" : "==Basics==\n\n** Selecting Slots**\nTo select a slot to edit, click on the slot inside the inventory GUI. The slot will be highlighted (color we choose) if it has been selected.\n\n**Setting the itemstacks type*\nAfter selecting a slot, to set an itemstack's type you need to click the Material selector inside the Stack Details tab and scroll down the list till you find the itemstack you want. Keep in mind the names of each item are the same as those in-game, which are not the same as the Material types for Bukkit or Spigot \n\n**Setting the name of an itemstack** To change the name of an itemstack, click on the Name Editor inside the Stack Details tab. The name editor supports ChatColors and color codes.\n\n**Setting the lore of an itemstack**\nTo set the lore of an itemstack, select the Lore editor in the Lore tab. In here, each new line in the editor represents a new line in the lore. The lore editor supports chatcolors.\n\n**Adding Enchantments**\nTo add enchantments, you have to select the Enchantments tab. From there, select the enchantment you want to add and the power level. Once you set those values, click the \"Add Enchantment\" button to add the enchantment. To remove an enchantment, click the \"remove enchantment\" button while having the enchatnment selector set to thr enchantment you want to remove.\n\n Note that you can only add one of each type of enchantment to an itemstack. Adding a new enchentment that has the same enchantment type as another existing enchantment will override the previous enchantmet.\n\n**Moving existing itemstacks to another slot**\nTo move itemstacks to other slots in teh inventory, simply click the itemstack you want to move and drag it over to the new slot. Note that the current version of this program does not display an image being dragged when you move the itemstack",
    "tutorial-1" : "This section is meant for aditional itemstack editing that has not yet been added to the program.\n\nIdeas for this section include alternating displaynames/stack types, editing skullmeta/other item meta/ and /Raw/ coding (I.e having a text pane where the user can write the coee themselvs if this program does not have the a certain feature yet.)",
    "tutorial-2" : "==Exporting code==\n There are currently two ways to export your code:Copying to your clipboard and Opening a new window. \n\n **Copying to your clipboard**\nWith this option, you can click the \"Copy to clipboard\" button under the file/exportcode menu section towards the top-left corner of the window. What this does is it copies all of the code needed to create your inventory to your clipboard, where you can then press Control+V to paste your code directly to your IDE (I.e to Eclipse or Inteli-J)\n\n**Creating a new window**\nWith this option, you can click the \"Export to new window\" button under the file/exportcode menu section towards the top-left corner of the window. What this does is it opens a new window containing all the code you will need to create your inventory. You can then copy and paste each section of coce into yourr IDE (I.e to Eclipse or Inteli-J)",
    "tutorial-3" : "==Editing the Inventory==\n\n**Chaning the name of the inventory**\nYou can edit the name of the inventory by editing the Iinventory name rditor inside the Inventory tab. The inventory name editor supports chatcolors.\n\n**Chaning the amount of rows for the inventory**\nTo change the amount of rows for the inventory, select the row count inside the Inventory tab. \n\nNote that any itemstack in the deleted row will also be delelted as well."
  }
}
